# ЗАВДАННЯ 01

a = int(input("Введіть сторону a: "))
b = int(input("Введіть сторону b: "))
c = int(input("Введіть сторону c: "))
d = int(input("Введіть сторону d: "))

p = a+b+c+d
print(f"Периметр чотирикутника = {p}")


# ЗАВДАННЯ 02

a = int(input("Введіть довжину: "))
b = int(input("Введіть ширину: "))

s = a*b
print(f"Площа прямокутника = {s}")

# ЗАВДАННЯ 03

a = int(input("Введіть сторону квадрата: "))
s = a**2

print(f"Площа квадрата = {s}")


# ЗАВДАННЯ 04

a = int(input("Введіть довжину основи трикутника: "))
h = int(input("Введіть висоту трикутника: "))

s = 1/2*a*h

print(f"Площа трикутника = {s}")

# ЗАВДАННЯ 05

r = int(input("Вкажіть радіус кола: "))

s = 3.14*r**2

print (f"Площа круга = {s}")


# ЗАВДАННЯ 06

r = int(input("Вкажіть радіус кола: "))
l = 2*r*3.14

print(f"Довжина кола = {l}")


# ЗАВДАННЯ 07

p = int(input("Ціна за кг яблук: "))
m = int(input("Скільки кілограмів купити: "))

q = m*p

print(f"Ціна {m} кг яблук = {q}")

# ЗАВДАННЯ 08

p = int(input("Ціна товару: "))
d = int(input("Знижка: "))

n = p * (1 - d / 100)
print(f"Після знижки: {n} грн")


# ЗАВДАННЯ 09

p = int(input("Введіть ціну футболки: "))
t = int(input("Введіть податок: "))
pr = p * (1 + t / 100)
print(f"З податком: {pr} грн")

# ЗАВДАННЯ 10

x = int(input("Оцінка 1: "))
y = int(input("Оцінка 2: "))
z = int(input("Оцінка 3: "))

a = (x + y + z) / 3
print(f"Середній бал = {a}")

# ЗАВДАННЯ 11

s = int(input("Відстань: "))
t = int(input("Час: "))

v = s / t
print(f"Швидкість = {v} км/год")

# ЗАВДАННЯ 12

v = int(input("Швидкість потяга: "))
s = int(input("Відстань: "))

t = s / v
print(f"Час у дорозі = {t} год")

# ЗАВДАННЯ 13

v = int(input("Швидкість велосипедиста: "))
t = int(input("Час: "))

s = v * t
print(f"Відстань = {s} км")


# ЗАВДАННЯ 14

h = int(input("Введіть кількість годин: "))

m = h * 60
print(f"{h} год = {m} хв")

# ЗАВДАННЯ 15

m = int(input("Введіть кількість хвилин: "))

s = m * 60
print(f"{m} хв = {s} сек")

# ЗАВДАННЯ 16

a = int(input("Довжина кімнати: "))
b = int(input("Ширина кімнати: "))

ar = a * b
print(f"Площа кімнати = {ar} м2")

# ЗАВДАННЯ 17

a = int(input("Довжина кімнати: "))
b = int(input("Ширина кімнати: "))
x = int(input("Площа однієї плитки: "))

a = a * b
t = -(-a // x)
print(f"Потрібно плиток = {t}")


# ЗАВДАННЯ 18

s1 = int(input("Шлях 1: "))
t1 = int(input("Час 1: "))
s2 = int(input("Шлях 2: "))
t2 = int(input("Час 2: "))

a = (s1 + s2) / (t1 + t2)
print(f"Середня швидкість = {a} км/год")


# ЗАВДАННЯ 19

p = int(input("Сума депозиту: "))
r = int(input("Річна ставка: "))

d = p * (1 + r / 100)
print(f"Сума через рік = {d} грн")


# ЗАВДАННЯ 20

a = int(input("Довжина коробки: "))
b = int(input("Ширина коробки: "))
c = int(input("Висота коробки: "))

v = a * b * c
print(f"Об’єм коробки = {v} см3")

